; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-5-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	p0-1 - location
	p0-3 - location
	p0-14 - location
	p1-2 - location
	p1-4 - location
	p1-13 - location
	p3-5 - location
	p3-10 - location
	p4-6 - location
	p4-10 - location
	p5-13 - location
	p6-2 - location
	p6-4 - location
	p6-8 - location
	p6-9 - location
	p6-11 - location
	p6-13 - location
	p7-0 - location
	p7-5 - location
	p8-0 - location
	p8-7 - location
	p9-0 - location
	p9-4 - location
	p11-4 - location
	p11-12 - location
	p12-2 - location
	p12-8 - location
	p12-10 - location
	p14-3 - location
	)
	(:init
	(at driver1 s13)
	(at driver2 s8)
	(at driver3 s10)
	(at driver4 s7)
	(at driver5 s1)
	(at truck1 s10)
	(empty truck1)
	(at truck2 s14)
	(empty truck2)
	(at truck3 s6)
	(empty truck3)
	(at truck4 s12)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at package1 s14)
	(at package2 s0)
	(at package3 s8)
	(at package4 s10)
	(at package5 s3)
	(at package6 s12)
	(at package7 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 15)
	(= (time-to-walk p0-1 s0) 15)
	(= (time-to-walk s1 p0-1) 55)
	(= (time-to-walk p0-1 s1) 55)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 1)
	(= (time-to-walk p0-3 s0) 1)
	(= (time-to-walk s3 p0-3) 44)
	(= (time-to-walk p0-3 s3) 44)
	(path s0 p0-14)
	(path p0-14 s0)
	(path s14 p0-14)
	(path p0-14 s14)
	(= (time-to-walk s0 p0-14) 39)
	(= (time-to-walk p0-14 s0) 39)
	(= (time-to-walk s14 p0-14) 54)
	(= (time-to-walk p0-14 s14) 54)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 24)
	(= (time-to-walk p1-2 s1) 24)
	(= (time-to-walk s2 p1-2) 62)
	(= (time-to-walk p1-2 s2) 62)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 26)
	(= (time-to-walk p1-4 s1) 26)
	(= (time-to-walk s4 p1-4) 51)
	(= (time-to-walk p1-4 s4) 51)
	(path s1 p1-13)
	(path p1-13 s1)
	(path s13 p1-13)
	(path p1-13 s13)
	(= (time-to-walk s1 p1-13) 57)
	(= (time-to-walk p1-13 s1) 57)
	(= (time-to-walk s13 p1-13) 85)
	(= (time-to-walk p1-13 s13) 85)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 60)
	(= (time-to-walk p3-5 s3) 60)
	(= (time-to-walk s5 p3-5) 62)
	(= (time-to-walk p3-5 s5) 62)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(= (time-to-walk s3 p3-10) 99)
	(= (time-to-walk p3-10 s3) 99)
	(= (time-to-walk s10 p3-10) 47)
	(= (time-to-walk p3-10 s10) 47)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 19)
	(= (time-to-walk p4-6 s4) 19)
	(= (time-to-walk s6 p4-6) 84)
	(= (time-to-walk p4-6 s6) 84)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(= (time-to-walk s4 p4-10) 97)
	(= (time-to-walk p4-10 s4) 97)
	(= (time-to-walk s10 p4-10) 88)
	(= (time-to-walk p4-10 s10) 88)
	(path s5 p5-13)
	(path p5-13 s5)
	(path s13 p5-13)
	(path p5-13 s13)
	(= (time-to-walk s5 p5-13) 21)
	(= (time-to-walk p5-13 s5) 21)
	(= (time-to-walk s13 p5-13) 88)
	(= (time-to-walk p5-13 s13) 88)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 13)
	(= (time-to-walk p6-2 s6) 13)
	(= (time-to-walk s2 p6-2) 67)
	(= (time-to-walk p6-2 s2) 67)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(= (time-to-walk s6 p6-8) 85)
	(= (time-to-walk p6-8 s6) 85)
	(= (time-to-walk s8 p6-8) 94)
	(= (time-to-walk p6-8 s8) 94)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(= (time-to-walk s6 p6-9) 81)
	(= (time-to-walk p6-9 s6) 81)
	(= (time-to-walk s9 p6-9) 66)
	(= (time-to-walk p6-9 s9) 66)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(= (time-to-walk s6 p6-11) 6)
	(= (time-to-walk p6-11 s6) 6)
	(= (time-to-walk s11 p6-11) 93)
	(= (time-to-walk p6-11 s11) 93)
	(path s6 p6-13)
	(path p6-13 s6)
	(path s13 p6-13)
	(path p6-13 s13)
	(= (time-to-walk s6 p6-13) 17)
	(= (time-to-walk p6-13 s6) 17)
	(= (time-to-walk s13 p6-13) 21)
	(= (time-to-walk p6-13 s13) 21)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 48)
	(= (time-to-walk p7-0 s7) 48)
	(= (time-to-walk s0 p7-0) 17)
	(= (time-to-walk p7-0 s0) 17)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 64)
	(= (time-to-walk p7-5 s7) 64)
	(= (time-to-walk s5 p7-5) 86)
	(= (time-to-walk p7-5 s5) 86)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(= (time-to-walk s8 p8-0) 70)
	(= (time-to-walk p8-0 s8) 70)
	(= (time-to-walk s0 p8-0) 88)
	(= (time-to-walk p8-0 s0) 88)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(= (time-to-walk s8 p8-7) 48)
	(= (time-to-walk p8-7 s8) 48)
	(= (time-to-walk s7 p8-7) 95)
	(= (time-to-walk p8-7 s7) 95)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(= (time-to-walk s9 p9-0) 38)
	(= (time-to-walk p9-0 s9) 38)
	(= (time-to-walk s0 p9-0) 5)
	(= (time-to-walk p9-0 s0) 5)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(= (time-to-walk s9 p9-4) 80)
	(= (time-to-walk p9-4 s9) 80)
	(= (time-to-walk s4 p9-4) 97)
	(= (time-to-walk p9-4 s4) 97)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(= (time-to-walk s11 p11-4) 67)
	(= (time-to-walk p11-4 s11) 67)
	(= (time-to-walk s4 p11-4) 78)
	(= (time-to-walk p11-4 s4) 78)
	(path s11 p11-12)
	(path p11-12 s11)
	(path s12 p11-12)
	(path p11-12 s12)
	(= (time-to-walk s11 p11-12) 44)
	(= (time-to-walk p11-12 s11) 44)
	(= (time-to-walk s12 p11-12) 85)
	(= (time-to-walk p11-12 s12) 85)
	(path s12 p12-2)
	(path p12-2 s12)
	(path s2 p12-2)
	(path p12-2 s2)
	(= (time-to-walk s12 p12-2) 61)
	(= (time-to-walk p12-2 s12) 61)
	(= (time-to-walk s2 p12-2) 40)
	(= (time-to-walk p12-2 s2) 40)
	(path s12 p12-8)
	(path p12-8 s12)
	(path s8 p12-8)
	(path p12-8 s8)
	(= (time-to-walk s12 p12-8) 72)
	(= (time-to-walk p12-8 s12) 72)
	(= (time-to-walk s8 p12-8) 82)
	(= (time-to-walk p12-8 s8) 82)
	(path s12 p12-10)
	(path p12-10 s12)
	(path s10 p12-10)
	(path p12-10 s10)
	(= (time-to-walk s12 p12-10) 28)
	(= (time-to-walk p12-10 s12) 28)
	(= (time-to-walk s10 p12-10) 85)
	(= (time-to-walk p12-10 s10) 85)
	(path s14 p14-3)
	(path p14-3 s14)
	(path s3 p14-3)
	(path p14-3 s3)
	(= (time-to-walk s14 p14-3) 49)
	(= (time-to-walk p14-3 s14) 49)
	(= (time-to-walk s3 p14-3) 12)
	(= (time-to-walk p14-3 s3) 12)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 78)
	(= (time-to-drive s7 s0) 78)
	(link s0 s13)
	(link s13 s0)
	(= (time-to-drive s0 s13) 29)
	(= (time-to-drive s13 s0) 29)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 77)
	(= (time-to-drive s4 s1) 77)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 84)
	(= (time-to-drive s9 s1) 84)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 22)
	(= (time-to-drive s10 s1) 22)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 93)
	(= (time-to-drive s9 s2) 93)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 4)
	(= (time-to-drive s11 s2) 4)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 69)
	(= (time-to-drive s4 s3) 69)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 10)
	(= (time-to-drive s6 s3) 10)
	(link s3 s12)
	(link s12 s3)
	(= (time-to-drive s3 s12) 68)
	(= (time-to-drive s12 s3) 68)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 55)
	(= (time-to-drive s5 s4) 55)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 79)
	(= (time-to-drive s10 s4) 79)
	(link s4 s12)
	(link s12 s4)
	(= (time-to-drive s4 s12) 55)
	(= (time-to-drive s12 s4) 55)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 3)
	(= (time-to-drive s2 s5) 3)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 74)
	(= (time-to-drive s6 s5) 74)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 93)
	(= (time-to-drive s8 s5) 93)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 8)
	(= (time-to-drive s1 s6) 8)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 53)
	(= (time-to-drive s8 s6) 53)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 90)
	(= (time-to-drive s11 s6) 90)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 74)
	(= (time-to-drive s4 s7) 74)
	(link s7 s12)
	(link s12 s7)
	(= (time-to-drive s7 s12) 31)
	(= (time-to-drive s12 s7) 31)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 33)
	(= (time-to-drive s0 s9) 33)
	(link s9 s12)
	(link s12 s9)
	(= (time-to-drive s9 s12) 58)
	(= (time-to-drive s12 s9) 58)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 92)
	(= (time-to-drive s0 s10) 92)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 73)
	(= (time-to-drive s5 s10) 73)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 30)
	(= (time-to-drive s9 s10) 30)
	(link s10 s13)
	(link s13 s10)
	(= (time-to-drive s10 s13) 73)
	(= (time-to-drive s13 s10) 73)
	(link s10 s14)
	(link s14 s10)
	(= (time-to-drive s10 s14) 100)
	(= (time-to-drive s14 s10) 100)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 14)
	(= (time-to-drive s3 s11) 14)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 21)
	(= (time-to-drive s7 s11) 21)
	(link s12 s10)
	(link s10 s12)
	(= (time-to-drive s12 s10) 12)
	(= (time-to-drive s10 s12) 12)
	(link s13 s2)
	(link s2 s13)
	(= (time-to-drive s13 s2) 91)
	(= (time-to-drive s2 s13) 91)
	(link s13 s6)
	(link s6 s13)
	(= (time-to-drive s13 s6) 50)
	(= (time-to-drive s6 s13) 50)
	(link s13 s7)
	(link s7 s13)
	(= (time-to-drive s13 s7) 89)
	(= (time-to-drive s7 s13) 89)
	(link s14 s2)
	(link s2 s14)
	(= (time-to-drive s14 s2) 74)
	(= (time-to-drive s2 s14) 74)
	(link s14 s8)
	(link s8 s14)
	(= (time-to-drive s14 s8) 71)
	(= (time-to-drive s8 s14) 71)
	(link s14 s9)
	(link s9 s14)
	(= (time-to-drive s14 s9) 82)
	(= (time-to-drive s9 s14) 82)
	(link s14 s12)
	(link s12 s14)
	(= (time-to-drive s14 s12) 78)
	(= (time-to-drive s12 s14) 78)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s11)
	(at driver4 s6)
	(at driver5 s0)
	(at truck1 s12)
	(at truck4 s7)
	(at package1 s8)
	(at package2 s2)
	(at package3 s12)
	(at package4 s5)
	(at package5 s6)
	(at package6 s2)
	(at package7 s1)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 4  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver3 truck1 s10)
   deleted: (at driver3 s10) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 12
2. (drive-truck truck1 s10 s12 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s12)
   changed: (driven) from 0 to 12
   goals met: 2 of 12
3. (load-truck package6 truck1 s12)
   deleted: (at package6 s12)
   added: (in package6 truck1)
   goals met: 2 of 12
4. (walk driver5 s1 p0-1)
   deleted: (at driver5 s1)
   added: (at driver5 p0-1)
   changed: (walked) from 0 to 55
   goals met: 2 of 12
5. (walk driver5 p0-1 s0)
   deleted: (at driver5 p0-1)
   added: (at driver5 s0)
   changed: (walked) from 55 to 70
   goals met: 3 of 12
6. (walk driver2 s8 p6-8)
   deleted: (at driver2 s8)
   added: (at driver2 p6-8)
   changed: (walked) from 70 to 164
   goals met: 3 of 12
7. (walk driver2 p6-8 s6)
   deleted: (at driver2 p6-8)
   added: (at driver2 s6)
   changed: (walked) from 164 to 249
   goals met: 3 of 12
8. (walk driver2 s6 p6-11)
   deleted: (at driver2 s6)
   added: (at driver2 p6-11)
   changed: (walked) from 249 to 255
   goals met: 3 of 12
9. (walk driver2 p6-11 s11)
   deleted: (at driver2 p6-11)
   added: (at driver2 s11)
   changed: (walked) from 255 to 348
   goals met: 4 of 12
10. (drive-truck truck1 s12 s14 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s14)
   changed: (driven) from 12 to 90
   goals met: 3 of 12
11. (load-truck package1 truck1 s14)
   deleted: (at package1 s14)
   added: (in package1 truck1)
   goals met: 3 of 12
12. (walk driver4 s7 p8-7)
   deleted: (at driver4 s7)
   added: (at driver4 p8-7)
   changed: (walked) from 348 to 443
   goals met: 3 of 12
13. (walk driver4 p8-7 s8)
   deleted: (at driver4 p8-7)
   added: (at driver4 s8)
   changed: (walked) from 443 to 491
   goals met: 3 of 12
14. (walk driver4 s8 p6-8)
   deleted: (at driver4 s8)
   added: (at driver4 p6-8)
   changed: (walked) from 491 to 585
   goals met: 3 of 12
15. (walk driver4 p6-8 s6)
   deleted: (at driver4 p6-8)
   added: (at driver4 s6)
   changed: (walked) from 585 to 670
   goals met: 4 of 12
16. (drive-truck truck1 s14 s8 driver3)
   deleted: (at truck1 s14)
   added: (at truck1 s8)
   changed: (driven) from 90 to 161
   goals met: 4 of 12
17. (unload-truck package1 truck1 s8)
   deleted: (in package1 truck1)
   added: (at package1 s8)
   goals met: 5 of 12
18. (drive-truck truck1 s8 s5 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   changed: (driven) from 161 to 254
   goals met: 5 of 12
19. (walk driver2 s11 p11-12)
   deleted: (at driver2 s11)
   added: (at driver2 p11-12)
   changed: (walked) from 670 to 714
   goals met: 4 of 12
20. (walk driver2 p11-12 s12)
   deleted: (at driver2 p11-12)
   added: (at driver2 s12)
   changed: (walked) from 714 to 799
   goals met: 4 of 12
21. (board-truck driver2 truck4 s12)
   deleted: (at driver2 s12) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 4 of 12
22. (drive-truck truck4 s12 s3 driver2)
   deleted: (at truck4 s12)
   added: (at truck4 s3)
   changed: (driven) from 254 to 322
   goals met: 4 of 12
23. (load-truck package5 truck4 s3)
   deleted: (at package5 s3)
   added: (in package5 truck4)
   goals met: 4 of 12
24. (drive-truck truck4 s3 s11 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s11)
   changed: (driven) from 322 to 336
   goals met: 4 of 12
25. (drive-truck truck1 s5 s10 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s10)
   changed: (driven) from 336 to 409
   goals met: 4 of 12
26. (load-truck package4 truck1 s10)
   deleted: (at package4 s10)
   added: (in package4 truck1)
   goals met: 4 of 12
27. (drive-truck truck1 s10 s5 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s5)
   changed: (driven) from 409 to 482
   goals met: 4 of 12
28. (unload-truck package4 truck1 s5)
   deleted: (in package4 truck1)
   added: (at package4 s5)
   goals met: 5 of 12
29. (drive-truck truck1 s5 s8 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s8)
   changed: (driven) from 482 to 575
   goals met: 5 of 12
30. (load-truck package3 truck1 s8)
   deleted: (at package3 s8)
   added: (in package3 truck1)
   goals met: 5 of 12
31. (drive-truck truck1 s8 s14 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s14)
   changed: (driven) from 575 to 646
   goals met: 5 of 12
32. (drive-truck truck1 s14 s12 driver3)
   deleted: (at truck1 s14)
   added: (at truck1 s12)
   changed: (driven) from 646 to 724
   goals met: 6 of 12
33. (unload-truck package3 truck1 s12)
   deleted: (in package3 truck1)
   added: (at package3 s12)
   goals met: 7 of 12
34. (drive-truck truck4 s11 s6 driver2)
   deleted: (at truck4 s11)
   added: (at truck4 s6)
   changed: (driven) from 724 to 814
   goals met: 7 of 12
35. (unload-truck package5 truck4 s6)
   deleted: (in package5 truck4)
   added: (at package5 s6)
   goals met: 8 of 12
36. (drive-truck truck4 s6 s11 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s11)
   changed: (driven) from 814 to 904
   goals met: 8 of 12
37. (drive-truck truck1 s12 s14 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s14)
   changed: (driven) from 904 to 982
   goals met: 7 of 12
38. (drive-truck truck1 s14 s2 driver3)
   deleted: (at truck1 s14)
   added: (at truck1 s2)
   changed: (driven) from 982 to 1056
   goals met: 7 of 12
39. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 8 of 12
40. (drive-truck truck1 s2 s14 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s14)
   changed: (driven) from 1056 to 1130
   goals met: 8 of 12
41. (drive-truck truck1 s14 s12 driver3)
   deleted: (at truck1 s14)
   added: (at truck1 s12)
   changed: (driven) from 1130 to 1208
   goals met: 9 of 12
42. (drive-truck truck4 s11 s2 driver2)
   deleted: (at truck4 s11)
   added: (at truck4 s2)
   changed: (driven) from 1208 to 1212
   goals met: 9 of 12
43. (drive-truck truck4 s2 s9 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s9)
   changed: (driven) from 1212 to 1305
   goals met: 9 of 12
44. (drive-truck truck4 s9 s12 driver2)
   deleted: (at truck4 s9)
   added: (at truck4 s12)
   changed: (driven) from 1305 to 1363
   goals met: 9 of 12
45. (drive-truck truck1 s12 s9 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s9)
   changed: (driven) from 1363 to 1421
   goals met: 8 of 12
46. (drive-truck truck1 s9 s0 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s0)
   changed: (driven) from 1421 to 1454
   goals met: 8 of 12
47. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 8 of 12
48. (drive-truck truck1 s0 s13 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s13)
   changed: (driven) from 1454 to 1483
   goals met: 8 of 12
49. (drive-truck truck1 s13 s2 driver3)
   deleted: (at truck1 s13)
   added: (at truck1 s2)
   changed: (driven) from 1483 to 1574
   goals met: 8 of 12
50. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   goals met: 9 of 12
51. (drive-truck truck1 s2 s9 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s9)
   changed: (driven) from 1574 to 1667
   goals met: 9 of 12
52. (disembark-truck driver2 truck4 s12)
   deleted: (driving driver2 truck4)
   added: (at driver2 s12) (empty truck4)
   goals met: 9 of 12
53. (drive-truck truck1 s9 s12 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s12)
   changed: (driven) from 1667 to 1725
   goals met: 10 of 12
54. (walk driver2 s12 p11-12)
   deleted: (at driver2 s12)
   added: (at driver2 p11-12)
   changed: (walked) from 799 to 884
   goals met: 10 of 12
55. (walk driver2 p11-12 s11)
   deleted: (at driver2 p11-12)
   added: (at driver2 s11)
   changed: (walked) from 884 to 928
   goals met: 11 of 12
56. (disembark-truck driver3 truck1 s12)
   deleted: (driving driver3 truck1)
   added: (at driver3 s12) (empty truck1)
   goals met: 11 of 12
57. (board-truck driver3 truck4 s12)
   deleted: (at driver3 s12) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 11 of 12
58. (drive-truck truck4 s12 s7 driver3)
   deleted: (at truck4 s12)
   added: (at truck4 s7)
   changed: (driven) from 1725 to 1756
   goals met: 12 of 12
